makapuf/bitbox-spectrum/zx_spectrum_lib/stm32_ub_spectrum.c
//--------------------------------------------------------------
// File     : stm32_ub_spectrum.c
// Datum    : 30.01.2014
// Version  : 1.1
// Autor    : UB
// EMail    : mc-4u(@)t-online.de
// Web      : www.mikrocontroller-4u.de
// CPU      : STM32F429
// IDE      : CooCox CoIDE 1.7.4
// GCC      : 4.7 2012q4
// Module   : Z80, retarget_printf, TIM
// Funktion : ZX-Spectrum-Emulator per STM32F429
//
// Hinweis  : Z80-Emulator von "Marat Fayzullin" (17.08.2007)
//            Quelle = "http://fms.komkon.org/"
//
// Portpins : PB2 = Speaker-Out
//            PA9 = UART-TX, PA10 = UART-RX (115200 Baud, 8N1)
//   
// IO-Pins  : PA0  = IN  [an Port 0xAAAA,Bit0]  => (User-Button)
//            PG14 = OUT [an Port 0xAAAA,Bit0]  => (LED_RED)
//
// Keyboard : "ALT"+"ESC" = Reset (start ZX-Spectrum Basic)
//            "ALT"+"F1"  = Start Game Nr.1 from Flash (Z80-File)
//            "ALT"+"F1"  = Start Game Nr.2 from Flash (Z80-File)
//            "ALT"+"h"   = Help
//            "ALT"+"s"   = Save RAM over UART to PC (Z80-File)
//            "ALT"+"l"   = Load Basic-File over UART from PC (Z80-File)
//            "ALT"+"g"   = Load Game-File over UART from PC (Z80-File)
//
// Kempston-Joystick emulation :
//    Cursor_Left, Cursor_Right, Cursor_Up, Cursor_Down, Right_ALT
//--------------------------------------------------------------


//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32_ub_spectrum.h"


//---------------------------------------------------
// globale Variable
//---------------------------------------------------
char str_buf[20];


//---------------------------------------------------
// interne Funktionen
//---------------------------------------------------
void P_Spectrum_initIO(void);
void P_Spectrum_clearSpectrumRAM(void);
void P_Spectrum_clearTransferRAM(void);
void P_Spectrum_startFunktion(uint32_t nr);


//---------------------------------------------------
// Tastatur-DEBUG
//---------------------------------------------------
#if ZX_DEBUG_KEY==1
uint16_t dbg_k1,dbg_k2,dbg_s;
#endif



//--------------------------------------------------------------
// 64K Memory-MAP vom ZX-Spectrum (16k ROM + 48K RAM)
//
// 0x0000 - 0x3FFF : 0x4000 => ROM
// 0x4000 - 0x57FF : 0x1800 => Display RAM (nur Pixeldaten ohne Farben)
// 0x5800 - 0x5AFF : 0x0300 => Attribue RAM (Display Farbinformationen)
// 0x5B00 - 0xFFFF : 0xA500 => Data RAM
//--------------------------------------------------------------
extern byte Z80_ROM[];      // 16k ROM
byte Z80_RAM[0xC000];       // 48k RAM


//--------------------------------------------------------------
// Z80-CPU Struktur
//--------------------------------------------------------------
Z80 myCPU;


//--------------------------------------------------------------
// init vom ZX-Spectrum
// -reset der CPU
// -reset aller Speicher
// -init der Hardware
//--------------------------------------------------------------
void UB_Spectrum_init(void)
{
  uint32_t n;

  // init der Variabeln
  ZX_Spectrum.akt_mode=0;   // 0=BASIC
  ZX_Spectrum.cpu_delay=0;
  ZX_Spectrum.led_mode=0;   // 0=normal
  ZX_Spectrum.tr_buffer_len=0;

  // init aller IO-Pins
  P_Spectrum_initIO();

  // Reset der CPU
  ResetZ80(&myCPU);

  // loeschen vom Tastaturpuffer
  key_ram[0]=0xFF;
  key_ram[1]=0xFF;
  key_ram[2]=0xFF;
  key_ram[3]=0xFF;
  key_ram[4]=0xFF;
  key_ram[5]=0xFF;
  key_ram[6]=0xFF;
  key_ram[7]=0xFF;

  // loeschen vom Ausgabe RAM
  out_ram=0x00;
  // loeschen vom Kempston RAM
  kempston_ram=0x00;

  // init der Farben (bright=1)
  b1_colmap[0]=SPECTRUM_COL_00;
  b1_colmap[1]=SPECTRUM_COL_01;
  b1_colmap[2]=SPECTRUM_COL_02;
  b1_colmap[3]=SPECTRUM_COL_03;
  b1_colmap[4]=SPECTRUM_COL_04;
  b1_colmap[5]=SPECTRUM_COL_05;
  b1_colmap[6]=SPECTRUM_COL_06;
  b1_colmap[7]=SPECTRUM_COL_07;
  // init der Farben (bright=0)
  b0_colmap[0]=SPECTRUM_COL_00;
  b0_colmap[1]=SPECTRUM_COL_08;
  b0_colmap[2]=SPECTRUM_COL_09;
  b0_colmap[3]=SPECTRUM_COL_10;
  b0_colmap[4]=SPECTRUM_COL_11;
  b0_colmap[5]=SPECTRUM_COL_12;
  b0_colmap[6]=SPECTRUM_COL_13;
  b0_colmap[7]=SPECTRUM_COL_14;

  // loeschen vom Spectrum-RAM
  P_Spectrum_clearSpectrumRAM();

  // loeschen vom LCD-RAM
  for(n=0;n<SPECTRUM_PIXEL;n++) {
    lcd_ram[n]=0x00;
  }

  // loeschen vom Transfer-RAM
  P_Spectrum_clearTransferRAM();
}


//--------------------------------------------------------------
// einige Befehlszyklen vom ZX-Spectrum abarbeiten
//
// cycles = Anzahl der CPU-Befehle die abgearbeitet werden sollen
//--------------------------------------------------------------
void UB_Spectrum_exec(uint16_t cycles)
{	
  ExecZ80(&myCPU,cycles);	
}


//--------------------------------------------------------------
// loest einen externen Interrupt vom ZX-Spectrum aus
// (muss alle 20ms aufgerufen werden !!)
//
// damit das ZX-Spectrum-Basic die Tastatur pollt
//--------------------------------------------------------------
void UB_Sepctrum_interrupt(void)
{
  IntZ80(&myCPU,INT_IRQ);
}


//--------------------------------------------------------------
// refresh vom LCD-Inhalt
//
// Hinweis : diese Funktion bremst das System und muss
//           so schnell wie moeglich abgearbeitet werden
//           (im Moment betraegt die Durchlaufzeit ca 12ms)
//
// ToDo : Funktion in Assembler programmieren ;-)
//
// 1. Display-RAM mit Bordercolor loeschen
// 2. Bildinhalt ins interne RAM kopieren
// 3. Daten vom interne RAM ins Display-RAM kopieren (per DMA2D)
// 4. Display-RAM anzeigen
//--------------------------------------------------------------
void UB_Spectrum_LCD_refresh(void)
{
   uint16_t xchar,ychar,ypixel;
   uint16_t adr1=0,adr2=0,vg_color=0x0000,bg_color=0xFFFF;
   uint8_t screen_wert,attribut,col_nr;
   static uint8_t flash_counter=0;
   uint32_t lcd_ram_adr=0;

   // Bordercolor bestimmen
   col_nr=(out_ram&0x07); // 0...7
   bg_color=b0_colmap[col_nr];

