makapuf/bitbox-spectrum/zx_spectrum_lib/stm32_ub_spectrum.c
   //----------------------------
   // Display Screen mit
   // BorderColor loeschen
   //----------------------------
   UB_Graphic2D_ClearSreenDMA(bg_color);

   // Counter fuer Flash-Funktion
   flash_counter++;

   //----------------------------
   // kompletten Spectrum-Screen
   // ins interne RAM zeichnen
   //----------------------------
   adr1=0x00; // Start-Adr vom Screen-RAM

   // alle 192 Zeilen vom Screen durchgehen
   for(ypixel=0;ypixel<SPECTRUM_MAXY;ypixel++) {
     ychar=(ypixel>>3);
     adr2=0x1800+(ychar<<5);

     // start RAM adresse berechnen fuer eine Zeile
     lcd_ram_adr=SPECTRUM_MAXY-ypixel-1;

     // eine komplette Linie zeichnen (byteweise)
     for(xchar=0;xchar<SPECTRUM_CHAR_X;xchar++) {
       // Pixel-Wert (fuer 8Pixel) lesen
       screen_wert=Z80_RAM[adr1];
       adr1++;
       // Attribut-Wert (von einem Block) lesen
       attribut=Z80_RAM[adr2];
       adr2++;

       // bright_bit auswerten
       if((attribut&0x40)!=0) {
         // bright="1"
         col_nr=(attribut&0x07);
         vg_color=b1_colmap[col_nr];
         col_nr=((attribut&0x38)>>3);
         bg_color=b1_colmap[col_nr];
       }
       else {
         // bright="0"
         col_nr=(attribut&0x07);
         vg_color=b0_colmap[col_nr];
         col_nr=((attribut&0x38)>>3);
         bg_color=b0_colmap[col_nr];
       }
       // flash_bit auswerten
       if((attribut&0x80)!=0) {
         // flash="1"
         if((flash_counter&0x04)!=0) {
           // flash zeitpunkt ist erreicht
           screen_wert^=0xFF;
         }
       }

       // eine Linie von einem Byte zeichnen (8 Pixel)
       if((screen_wert&0x80)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
       if((screen_wert&0x40)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
       if((screen_wert&0x20)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
       if((screen_wert&0x10)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
       if((screen_wert&0x08)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
       if((screen_wert&0x04)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
       if((screen_wert&0x02)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
       if((screen_wert&0x01)!=0) lcd_ram[lcd_ram_adr]=vg_color; else lcd_ram[lcd_ram_adr]=bg_color;
       lcd_ram_adr+=SPECTRUM_MAXY;
     }
   }

   //----------------------------
   // Screen vom internen RAM ins
   // SD-RAM per DMA2D kopieren
   //----------------------------
   UB_Graphic2D_CopySpectrumRAM();

   // Debug Ausgabe der Tasten-Nummern
   #if ZX_DEBUG_KEY==1
   sprintf(str_buf,"K1=%d  K2=%d  S=%d ",(int)(dbg_k1),(int)(dbg_k2),(int)(dbg_s));
   UB_Font_DrawString(0,0,str_buf,&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
   #endif


   //----------------------------
   // neuen Screen anzeigen
   //----------------------------
   UB_LCD_Refresh();
}


//--------------------------------------------------------------
// Tastaturabfrage
// testet welche Tasten der USB-Tastatur gedrueckt sind
// und setzt die entsprechenden Bits vom ZX-Spectrum Tastatur-RAM
// bzw. vom Kemston-RAM (fuer Spiele)
// (Der ZX-Spectrum kann max zwei Tasten gleichzeitig auswerten)
//
// ueber Sondertasten werden hier auch Funktionen gestartet
// z.B. "Reset vom System" oder "Save per UART"
//--------------------------------------------------------------
void UB_Spectrum_KEY_scan(void)
{
  uint8_t akt_keyanz;
  uint8_t k1,k2;
  uint8_t akt_shift;
  static uint8_t reboot_flag=0;

  // gedrueckte Tasten abholen
  akt_keyanz=UB_USB_HID_HOST_GetKeyAnz();
  k1=USB_KEY_DATA.akt_key1;
  k2=USB_KEY_DATA.akt_key2;
  akt_shift=UB_USB_HID_HOST_GetShift();

  // Debug
  #if ZX_DEBUG_KEY==1
  dbg_k1=k1;
  dbg_k2=k2;
  dbg_s=akt_shift;
  #endif

  // alle Tasten auf "unbetaetigt"
  key_ram[0]=0xFF;
  key_ram[1]=0xFF;
  key_ram[2]=0xFF;
  key_ram[3]=0xFF;
  key_ram[4]=0xFF;
  key_ram[5]=0xFF;
  key_ram[6]=0xFF;
  key_ram[7]=0xFF;

  // Kempston-Joystick auf "unbetaetigt"
  kempston_ram=0x00;

  //----------------------------------------------
  if((akt_keyanz==0) && (akt_shift==0)) {
    reboot_flag=0;
    return; // keine Taste gedrueckt
  }

  //----------------------------------------------
  // Menu-Sondertasten (werden bevorzugt behandelt)
  // (nur die erste Taste wird ausgewertet)
  //----------------------------------------------
  if((akt_shift&0x08)!=0) { // left "ALT" ist betaetigt
    if(reboot_flag==0) {
      if(k1==110) { // "ESC" -> RESET
        reboot_flag=1;
        P_Spectrum_startFunktion(0);
        return;
      }
      if(k1==112) { // "F1" -> Spiel Nr.1 starten
        reboot_flag=1;
        P_Spectrum_startFunktion(1);
        return;
      }
      if(k1==113) { // "F2" -> Spiel Nr.2 starten
        reboot_flag=1;
        P_Spectrum_startFunktion(2);
        return;
      }
      if(k1==36) { // "h" -> Help
        reboot_flag=1;
        P_Spectrum_startFunktion(99);
        return;
      }
      if(k1==32) { // "s" -> Save RAM per UART
        reboot_flag=1;
        P_Spectrum_startFunktion(100);
        return;
      }
      if(k1==39) { // "l" -> Load BASIC per UART
        reboot_flag=1;
        P_Spectrum_startFunktion(101);
        return;
      }
      if(k1==35) { // "g" -> Load GAME per UART
        reboot_flag=1;
        P_Spectrum_startFunktion(102);
        return;
      }
    }
  }


  //----------------------------------------------
  // Mapped-Sondertasten (im BASIC-Mode)
  // (nur die erste Taste wird ausgewertet)
  //----------------------------------------------
  if(ZX_Spectrum.akt_mode==0) {
    if(k1==110) { // "ESC" -> BREAK
      key_ram[0]&=~0x01; // "caps shift"
      key_ram[7]&=~0x01; // "space"
    }
    if(k1==15) { // Delete
      key_ram[0]&=~0x01; // "caps shift"
      key_ram[4]&=~0x01; // "0"
      return;
    }
    if(k1==79) { // Cursor left
      key_ram[0]&=~0x01; // "caps shift"
      key_ram[3]&=~0x10; // "5"
      return;
    }
    if(k1==84) { // Cursor down
      key_ram[0]&=~0x01; // "caps shift"
      key_ram[4]&=~0x10; // "6"
      return;
    }
    if(k1==83) { // Cursor up
      key_ram[0]&=~0x01; // "caps shift"
      key_ram[4]&=~0x08; // "7"
      return;
    }
    if(k1==89) { // Cursor right
      key_ram[0]&=~0x01; // "caps shift"
      key_ram[4]&=~0x04; // "8"
      return;
    }
    if(k1==28) { // "+/*"
      if((akt_shift&0x01)==0) {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[6]&=~0x04; // "k"
      }
      else {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[7]&=~0x10; // "b"
      }
      return;
    }
    if(k1==29) { // "#/'"
      if((akt_shift&0x01)==0) {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[3]&=~0x04; // "3"
      }
      else {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[4]&=~0x08; // "7"
      }
      return;
    }
    if(k1==53) { // ",/;"
      if((akt_shift&0x01)==0) {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[7]&=~0x08; // "n"
      }
      else {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[5]&=~0x02; // "o"
      }
      return;
    }
    if(k1==54) { // "./:"
      if((akt_shift&0x01)==0) {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[7]&=~0x04; // "m"
      }
      else {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[0]&=~0x02; // "z"
      }
      return;
    }
    if(k1==55) { // "-/_"
      if((akt_shift&0x01)==0) {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[6]&=~0x08; // "j"
      }
      else {
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[4]&=~0x01; // "0"
      }
      return;
    }
    if((akt_shift&0x04)!=0) { // left "STRG" ist betaetigt
      if(k1==2) { // "!"
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[3]&=~0x01; // "1"
        return;
      }
      if(k1==3) { // "
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[5]&=~0x01; // "p"
        return;
      }
      if(k1==5) { // "$"
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[3]&=~0x08; // "4"
        return;
      }
      if(k1==6) { // "%"
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[3]&=~0x10; // "5"
        return;
      }
      if(k1==7) { // "&"
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[4]&=~0x10; // "6"
        return;
      }
      if(k1==8) { // "/"
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[0]&=~0x10; // "v"
        return;
      }
      if(k1==9) { // "("
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[4]&=~0x04; // "8"
        return;
      }
      if(k1==10) { // ")"
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[4]&=~0x02; // "9"
        return;
      }
      if(k1==11) { // "="
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[6]&=~0x02; // "l"
        return;
      }
      if(k1==12) { // "?"
        key_ram[7]&=~0x02; // "symbol shift"
        key_ram[0]&=~0x08; // "c"
        return;
      }
    }
  }
  //----------------------------------------------
  // Sondertasten (im GAME-Mode)
  // Fuer "Kempston-Joystick"
  // 4 Richtungstasten + Feuer
  //----------------------------------------------
  if(ZX_Spectrum.akt_mode==1) {
    // Cursor left
    if((k1==79) || (k2==79)) kempston_ram|=0x02;
    // Cursor down
    if((k1==84) || (k2==84)) kempston_ram|=0x04;
    // Cursor up
    if((k1==83) || (k2==83)) kempston_ram|=0x08;
    // Cursor right
    if((k1==89) || (k2==89)) kempston_ram|=0x01;
    // right "ALT" (fire)
    if((akt_shift&0x10)!=0) kempston_ram|=0x10;
  }
 
  //----------------------------------------------
  // "normale" ZX-Spectrum Tastenbhandlung
  //----------------------------------------------

  // test ob zu viele Tasten gedrueckt sind
  if((akt_shift&0x01)!=0) akt_keyanz++;
  if((akt_shift&0x02)!=0) akt_keyanz++;
  if(akt_keyanz>2) {
    // mehr als zwei Tasten sind nicht erlaubt
    return; 
  } 

  if((k1==49) || (k2==49)) key_ram[0]&=~0x10; // "v"
  if((k1==48) || (k2==48)) key_ram[0]&=~0x08; // "c"
  if((k1==47) || (k2==47)) key_ram[0]&=~0x04; // "x"
  if((k1==22) || (k2==22)) key_ram[0]&=~0x02; // "z"
  if((akt_shift&0x01)!=0) key_ram[0]&=~0x01;  // "caps shift"

