makapuf/bitbox-spectrum/zx_spectrum_lib/stm32_ub_spectrum.c
  if((k1==35) || (k2==35)) key_ram[1]&=~0x10; // "g"
  if((k1==34) || (k2==34)) key_ram[1]&=~0x08; // "f"
  if((k1==33) || (k2==33)) key_ram[1]&=~0x04; // "d"
  if((k1==32) || (k2==32)) key_ram[1]&=~0x02; // "s"
  if((k1==31) || (k2==31)) key_ram[1]&=~0x01; // "a"

  if((k1==21) || (k2==21)) key_ram[2]&=~0x10; // "t"
  if((k1==20) || (k2==20)) key_ram[2]&=~0x08; // "r"
  if((k1==19) || (k2==19)) key_ram[2]&=~0x04; // "e"
  if((k1==18) || (k2==18)) key_ram[2]&=~0x02; // "w"
  if((k1==17) || (k2==17)) key_ram[2]&=~0x01; // "q"

  if((k1==6) || (k2==6)) key_ram[3]&=~0x10;   // "5"
  if((k1==5) || (k2==5)) key_ram[3]&=~0x08;   // "4"
  if((k1==4) || (k2==4)) key_ram[3]&=~0x04;   // "3"
  if((k1==3) || (k2==3)) key_ram[3]&=~0x02;   // "2"
  if((k1==2) || (k2==2)) key_ram[3]&=~0x01;   // "1"

  if((k1==7) || (k2==7)) key_ram[4]&=~0x10;   // "6"
  if((k1==8) || (k2==8)) key_ram[4]&=~0x08;   // "7"
  if((k1==9) || (k2==9)) key_ram[4]&=~0x04;   // "8"
  if((k1==10) || (k2==10)) key_ram[4]&=~0x02; // "9"
  if((k1==11) || (k2==11)) key_ram[4]&=~0x01; // "0"

  if((k1==46) || (k2==46)) key_ram[5]&=~0x10; // "y"
  if((k1==23) || (k2==23)) key_ram[5]&=~0x08; // "u"
  if((k1==24) || (k2==24)) key_ram[5]&=~0x04; // "i"
  if((k1==25) || (k2==25)) key_ram[5]&=~0x02; // "o"
  if((k1==26) || (k2==26)) key_ram[5]&=~0x01; // "p"

  if((k1==36) || (k2==36)) key_ram[6]&=~0x10; // "h"
  if((k1==37) || (k2==37)) key_ram[6]&=~0x08; // "j"
  if((k1==38) || (k2==38)) key_ram[6]&=~0x04; // "k"
  if((k1==39) || (k2==39)) key_ram[6]&=~0x02; // "l"
  if((k1==43) || (k2==43)) key_ram[6]&=~0x01; // "enter"

  if((k1==50) || (k2==50)) key_ram[7]&=~0x10; // "b"
  if((k1==51) || (k2==51)) key_ram[7]&=~0x08; // "n"
  if((k1==52) || (k2==52)) key_ram[7]&=~0x04; // "m"
  if((akt_shift&0x02)!=0) key_ram[7]&=~0x02;  // "symbol shift"
  if((k1==61) || (k2==61)) key_ram[7]&=~0x01; // "space"
}


//--------------------------------------------------------------
// interne Z80-CPU-Funktion
// ein Byte ins RAM schreiben
//
// ADDR  : [0x4000 - 0xFFFF]
// Value : [0x00 - 0xFF]
//--------------------------------------------------------------
void WrZ80(register word Addr,register byte Value)
{
  uint16_t a1,a2,a3;

  if(Addr<0x4000) { // [0x0000 - 0x3FFF]
    //ROM
    // ins ROM kann nicht geschrieben werden
  }
  else if(Addr<0x5800) { // [0x4000 - 0x57FF]
    // Bildschirm RAM
    // Hinweis : um eine bessere performance zu bekommen,
    // wird das Screen-Ram hier umformatiert
    a1=(Addr&0x181F);
    a2=((Addr&0x0700)>>3);
    a3=((Addr&0x00E0)<<3);
    Addr=a1|a2|a3;
    Z80_RAM[Addr]=Value;
  }
  else if(Addr<0x5B00) { // [0x5800 - 0x5AFF]
    // Attribute RAM
    Z80_RAM[Addr-0x4000]=Value;
  }
  else { // [0x5B00 - 0xFFFF]
    // Data RAM
    Z80_RAM[Addr-0x4000]=Value;
  }
}


//--------------------------------------------------------------
// interne Z80-CPU-Funktion
// ein Byte vom ROM oder RAM lesen
//
// ADDR     : [0x0000 - 0xFFFF]
// ret_wert : [0x00 - 0xFF]
//--------------------------------------------------------------
byte RdZ80(register word Addr)
{
  byte ret_wert=0x00;
  uint16_t a1,a2,a3;

  if(Addr<0x4000) { // [0x0000 - 0x3FFF]
    //ROM
    ret_wert=Z80_ROM[Addr];
  }
  else if(Addr<0x5800) { // [0x4000 - 0x57FF]
    // Bildschirm RAM
    // Hinweis : um eine bessere performance zu bekommen,
    // wird das Screen-Ram hier umformatiert
    a1=(Addr&0x181F);
    a2=((Addr&0x0700)>>3);
    a3=((Addr&0x00E0)<<3);
    Addr=a1|a2|a3;
    ret_wert=Z80_RAM[Addr];
  }
  else if(Addr<0x5B00) { // [0x5800 - 0x5AFF]
    // Attribute RAM
    ret_wert=Z80_RAM[Addr-0x4000];
  }
  else { // [0x5B00 - 0xFFFF]
    // Data RAM
    ret_wert=Z80_RAM[Addr-0x4000];
  }

  return(ret_wert);
}


//--------------------------------------------------------------
// interne Z80-CPU-Funktion
// ein Byte an die Peripherie ausgeben
//
// Port  : [0x0000 - 0xFFFF]
// Value : [0x00 - 0xFF]
//--------------------------------------------------------------
void OutZ80(register word Port,register byte Value)
{
  if((Port&0xFF)==0xFE) {
    // BorderColor und Ton-Out speichern
    out_ram=Value;
    // Ton-Signal schalten
    if((Value&0x10)==0) {
      SPEAKER_PORT->BSRRH = SPEAKER_PIN; // Bit auf Lo
    }
    else {
      SPEAKER_PORT->BSRRL = SPEAKER_PIN; // Bit auf Hi
    }
  }
  if(Port==0xAAAA) {
    // 1bit Digital-OUT [Test von UB]
    ZX_Spectrum.led_mode=1;
    if((Value&0x01)==0) {
      LED_RED_PORT->BSRRH = LED_RED_PIN; // Bit auf Lo
    }
    else {
      LED_RED_PORT->BSRRL = LED_RED_PIN; // Bit auf Hi
    }
  }
}


//--------------------------------------------------------------
// interne Z80-CPU-Funktion
// ein Byte von der Peripherie lesen
//
// Port     : [0x0000 - 0xFFFF]
// ret_wert : [0x00 - 0xFF]
//--------------------------------------------------------------
byte InZ80(register word Port)
{
  byte ret_wert=0xFF;

  if((Port&0xFF)==0xFE) {
    // Abfrage der Tastatur und Ton-IN
    if(Port==0xFEFE) ret_wert=key_ram[0];
    if(Port==0xFDFE) ret_wert=key_ram[1];
    if(Port==0xFBFE) ret_wert=key_ram[2];
    if(Port==0xF7FE) ret_wert=key_ram[3];
    if(Port==0xEFFE) ret_wert=key_ram[4];
    if(Port==0xDFFE) ret_wert=key_ram[5];
    if(Port==0xBFFE) ret_wert=key_ram[6];
    if(Port==0x7FFE) ret_wert=key_ram[7];
  }
  else if((Port&0xFF)==0x1F) {
    // Abfrage vom Kempston-Joystick
    ret_wert=kempston_ram;
  }
  else if(Port==0xAAAA) {
    // 1bit Digital-IN [Test von UB]
    if(GPIO_ReadInputDataBit(BUTTON_PORT, BUTTON_PIN)==Bit_RESET) {
      ret_wert=0x00;
    }
    else {
      ret_wert=0x01;
    }
  }

  return(ret_wert);
}


//--------------------------------------------------------------
// interne Z80-CPU-Funktion
//--------------------------------------------------------------
void PatchZ80(register Z80 *R)
{
  // nothing to do
}


//--------------------------------------------------------------
// interne Z80-CPU-Funktion
//--------------------------------------------------------------
word LoopZ80(register Z80 *R)
{
  word ret_wert=0;

  // kein Interrupt wurde ausgeloest
  ret_wert=INT_NONE;

  return(ret_wert);
}


//--------------------------------------------------------------
// interne Funktion
// init aller IO-Pins
//--------------------------------------------------------------
void P_Spectrum_initIO(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  //---------------------------------
  // init vom Speaker-Pin
  //---------------------------------
  RCC_AHB1PeriphClockCmd(SPEAKER_CLOCK, ENABLE);

