makapuf/bitbox-spectrum/zx_spectrum_lib/stm32_ub_spectrum.c
  // Config als Digital-Ausgang
  GPIO_InitStructure.GPIO_Pin = SPEAKER_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(SPEAKER_PORT, &GPIO_InitStructure);

  // Bit auf Lo
  SPEAKER_PORT->BSRRH = SPEAKER_PIN;


  //---------------------------------
  // init vom Button-Pin
  //---------------------------------
  RCC_AHB1PeriphClockCmd(BUTTON_CLOCK, ENABLE);

  // Config als Digital-Eingang
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Pin = BUTTON_PIN;
  GPIO_Init(BUTTON_PORT, &GPIO_InitStructure);
}


//--------------------------------------------------------------
// interne Funktion
// loescht das 48k RAM vom Spectrum
//--------------------------------------------------------------
void P_Spectrum_clearSpectrumRAM(void)
{
  uint32_t n;

  // loeschen vom SpectrumRAM
  for(n=0;n<0xC000;n++) {
    Z80_RAM[n]=0x00;
  }
}


//--------------------------------------------------------------
// interne Funktion
// loescht das 48k Transfer-RAM
//--------------------------------------------------------------
void P_Spectrum_clearTransferRAM(void)
{
  uint32_t n;

  // loeschen vom TransferRAM
  for(n=0;n<TR_BUFFER_SIZE;n++) {
    *(volatile uint8_t*)(TR_BUFFER_START_ADR + n) = 0x00;
  }
}


//--------------------------------------------------------------
// interne Funktion
// startet eine Menu-Funktion (auserhalb vom Spectrum-Basic)
//
// nr : 0 = loescht das Spectrum-RAM und macht einen Reset der CPU
//      1 = loescht das Spectrum-RAM und startet ein Spiel vom Flash
//      2 = loescht das Spectrum-RAM und startet ein Spiel vom Flash
//     99 = zeigt Hilfe-Seite an
//    100 = kopiert das Spectrum-RAM in das Transfer-RAM (als Z80-File)
//          und sendet dann dieses per UART
//    101 = empfängt ein Basic-File per UART (als Z80-File) ins Transfer-RAM
//          und kopiert dieses dann ins Spectrum-RAM
//    102 = empfängt ein Game-File per UART (als Z80-File) ins Transfer-RAM
//          und kopiert dieses dann ins Spectrum-RAM
//--------------------------------------------------------------
void P_Spectrum_startFunktion(uint32_t nr)
{
  if(nr==1) {
    // komplettes Spectrum-RAM loeschen
    P_Spectrum_clearSpectrumRAM();
    // kopiert das Spiel "pssst" vom Flash
    ZX_ReadFromFlash_Z80(&myCPU,(const uint8_t*)ZX_Game_PSSST.table, ZX_Game_PSSST.len);
    // sprung zum aktuellen ProgramCounter  
    JumpZ80(R->PC.W);
    // Mode umstellen
    ZX_Spectrum.akt_mode=1; // 1=GAME
  }
  else if(nr==2) {
    // komplettes Spectrum-RAM loeschen
    P_Spectrum_clearSpectrumRAM();
    // kopiert das Spiel "AticAtac" vom Flash
    ZX_ReadFromFlash_Z80(&myCPU,(const uint8_t*)ZX_Game_AticAtac.table, ZX_Game_AticAtac.len);
    // sprung zum aktuellen ProgramCounter
    JumpZ80(R->PC.W);
    // Mode umstellen
    ZX_Spectrum.akt_mode=1; // 1=GAME
  }
  else if(nr==99) {
    // Mode umstellen
    ZX_Spectrum.akt_mode=5; // 5=HELP
  }
  else if(nr==100) {
    // komplettes Transfer-RAM loeschen
    P_Spectrum_clearTransferRAM();
    // Spectrum-RAM als Z80-File packen
    // und in Transfer-RAM kopieren
    ZX_Spectrum.tr_buffer_len=ZX_WriteToTransfer_Z80(&myCPU,(uint8_t*)(TR_BUFFER_START_ADR));
    // Mode umstellen
    ZX_Spectrum.akt_mode=2; // 2=SAVE
  }
  else if(nr==101) {
    // komplettes Transfer-RAM loeschen
    P_Spectrum_clearTransferRAM();
    ZX_Spectrum.tr_buffer_len=0;
    // Mode umstellen
    ZX_Spectrum.akt_mode=3; // 3=LOAD BASIC
  }
  else if(nr==102) {
    // komplettes Transfer-RAM loeschen
    P_Spectrum_clearTransferRAM();
    ZX_Spectrum.tr_buffer_len=0;
    // Mode umstellen
    ZX_Spectrum.akt_mode=4; // 4=LOAD GAME
  }
  else {
    // komplettes Spectrum-RAM loeschen
    P_Spectrum_clearSpectrumRAM();
    // Reset der CPU
    ResetZ80(&myCPU);
    // Mode umstellen
    ZX_Spectrum.akt_mode=0; // 0=BASIC
  }
}


//--------------------------------------------------------------
// Transfer-Buffer per UART senden (als ".Z80"-File)
//--------------------------------------------------------------
void UB_Spectrum_Send_Buffer(void)
{
  uint32_t n;
  uint8_t wert;

  // Screen loeschen und Text anzeigen
  UB_LCD_SetLayer_2();
  UB_LCD_SetTransparency(255);
  UB_LCD_FillLayer(RGB_COL_WHITE);
  UB_Font_DrawString(200,50," Send Buffer (Z80-File) ",&Arial_7x10,RGB_COL_WHITE,RGB_COL_RED);
  UB_Font_DrawString(160,20,"TX-Pin = PA9",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(140,20,"Setting = 115200 Baud, 8N1",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  sprintf(str_buf,"Bytes = %d",(int)(ZX_Spectrum.tr_buffer_len));
  UB_Font_DrawString(120,20,str_buf,&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(80,50,"sending...",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);

  // kompletten Transfer-Buffer per UART senden
  for(n=0;n<ZX_Spectrum.tr_buffer_len;n++) {
    wert=*(volatile uint8_t*)(TR_BUFFER_START_ADR + n);
    UB_Uart_SendByte(COM1, wert);
  }

  UB_Font_DrawString(80,50,"  ready.  ",&Arial_7x10,RGB_COL_BLACK,RGB_COL_GREEN);

  // Mode umstellen
  ZX_Spectrum.akt_mode=0; // 0=BASIC
}


//--------------------------------------------------------------
// ".Z80"-File per UART empfangen (in Transfer-Buffer)
// entweder ein Basic-File oder ein Game-File
//--------------------------------------------------------------
void UB_Spectrum_Load_Buffer(void)
{
  uint32_t tim_cnt=0,timeout=0;
  uint32_t old_len=0;

  // Screen loeschen und Text anzeigen
  UB_LCD_SetLayer_2();
  UB_LCD_SetTransparency(255);
  UB_LCD_FillLayer(RGB_COL_WHITE);
  if(ZX_Spectrum.akt_mode==3) {
    UB_Font_DrawString(200,50," Receive Basic-File (Z80-File) ",&Arial_7x10,RGB_COL_WHITE,RGB_COL_RED);
  }
  else {
    UB_Font_DrawString(200,50," Receive Game-File (Z80-File) ",&Arial_7x10,RGB_COL_WHITE,RGB_COL_RED);
  }
  UB_Font_DrawString(160,20,"RX-Pin = PA10",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(140,20,"Setting = 115200 Baud, 8N1",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(80,50,"waiting...",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);

