makapuf/bitbox-spectrum/zx_spectrum_lib/stm32_ub_spectrum.c
  // warten bis alle Bytes per UART in den Transfer-Buffer geladen wurden
  timeout=8000; // ca 5sec timeout
  do {
    sprintf(str_buf,"Bytes = %d",(int)(ZX_Spectrum.tr_buffer_len));
    UB_Font_DrawString(120,20,str_buf,&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
    tim_cnt++;
    if(ZX_Spectrum.tr_buffer_len!=old_len) {
      old_len=ZX_Spectrum.tr_buffer_len;
      tim_cnt=0;
      timeout=1000; // timeout verkürzen
    }
  }
  while(tim_cnt<timeout);

  if(ZX_Spectrum.tr_buffer_len==0) {
    UB_Font_DrawString(80,50," timeout  ",&Arial_7x10,RGB_COL_BLACK,RGB_COL_GREEN);
  }
  else {
    UB_Font_DrawString(80,50,"  ready.  ",&Arial_7x10,RGB_COL_BLACK,RGB_COL_GREEN);
  }

  // entpacken vom File und kopieren ins Spectrum-RAM
  if(ZX_Spectrum.tr_buffer_len>0) {
    // kopiert das geladene File vom Transfer-RAM
    ZX_ReadFromTransfer_Z80(&myCPU,(uint8_t*)(TR_BUFFER_START_ADR),ZX_Spectrum.tr_buffer_len);
    // sprung zum aktuellen ProgramCounter
    JumpZ80(R->PC.W);
  }

  // Mode umstellen
  if(ZX_Spectrum.akt_mode==3) {
    ZX_Spectrum.akt_mode=0; // 0=BASIC
  }
  else {
    ZX_Spectrum.akt_mode=1; // 1=GAME
  }
}


//--------------------------------------------------------------
// Hilfe Seite anzeigen
//--------------------------------------------------------------
void UB_Spectrum_Help(void)
{
  // Screen loeschen und Text anzeigen
  UB_LCD_SetLayer_2();
  UB_LCD_SetTransparency(255);
  UB_LCD_FillLayer(RGB_COL_WHITE);

  UB_Font_DrawString(220,50," HELP for ZX-Spectrum-Emulator ",&Arial_7x10,RGB_COL_WHITE,RGB_COL_RED);
  UB_Font_DrawString(190,5 ,"'ALT+ESC' = Reset (start ZX-Spectrum Basic)",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(170,5 ,"'ALT+F1'  = Start Game 'PSSST' from Flash",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(150,5 ,"'ALT+F2'  = Start Game 'AticAtac' from Flash",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(130,5 ,"'ALT+s'   = Send Basic-RAM to UART [PA9]",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(110,5 ,"'ALT+l'   = Load Basic-File from UART [PA10]",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(90 ,5 ,"'ALT+g'   = Load Game-File from UART [PA10]",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(70 ,5 ,"Kempston-Joystick = 'Cursor' and 'right ALT'",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(50 ,5 ,"Speaker-Out = [PB2]",&Arial_7x10,RGB_COL_BLACK,RGB_COL_WHITE);
  UB_Font_DrawString(20 ,50," www.Mikrocontroller.bplaced.net ",&Arial_7x10,RGB_COL_BLACK,RGB_COL_GREEN);

  // Mode umstellen
  ZX_Spectrum.akt_mode=0; // 0=BASIC
}
